Tekla Open API Reference for Tekla Structures 2025
LineTypes Fields
The LineTypes type exposes the following members.
Fields
Name | Description
DashDot
 The dash dotted line (--.--.).
DashDoubleDot
 The dash double dotted line (-..-..-).
DashedLine
 The dashed line (-----).
DottedLine
 The dotted line (.....).
SlashDash
 The slash dash line (-- - -- -).
SlashedLine
 The slashed line (- - -).
SolidLine
 The solid line (default).
UndefinedLine
 The line type is undefined.
Top
See Also
Reference
LineTypes Class
Tekla.Structures.Drawing Namespace